#通用变量
X_STAR_AB = '3'
api_host = 'https://krr-prd.star-api.com/api/'
proxycontrol = True
http_proxy = 'http://127.0.0.1:8888'
version = '1.0.4'
chaname = {
    "11002000":"柚子",    "13002000":"透",
    "15002000":"青叶",    "10002000":"由乃",
    "14002000":"可怜",    "12002000":"由纪",
    "17002000":"千矢",    "16002000":"珠辉"
}#首抽并不会抽到特殊卡
errorlist = {
    "10":"维护中",
    "101":"校验有误",    "102":"请求有误",
    "105":"服务器错误",    "203":"sessionID已失效",
    "212":"账号或uuid不存在或已引继",    "210":"引继账号或密码错误",
    "445":"星彩石数量不足",   "510":"已完成",
    "442":"物品数量不足"
}
